W6D3/Routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "Iamactuallysus@gmail.com"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT "users".* FROM "users"
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy
    render json: User.all