W7D5/redditclone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.mod_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "attemp2"], ["description", " rhejfhdjks"], ["mod_id", 1], ["created_at", "2022-05-13 14:53:04.926255"], ["updated_at", "2022-05-13 14:53:04.926255"]]