W6D3/ArtShare/app/controllers/artwork_shares_controller.rb

  def create
    shared_artwork = ArtworkShare.new(artwork_share_params)
    if shared_artwork.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2]]

  def destroy
    to_be_deleted = ArtworkShare.find_by(artwork_id: params[:artwork_id])
    to_be_deleted.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."artwork_id" = $1 LIMIT $2  [["artwork_id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 11]]