W6D3/ArtShare/app/controllers/artworks_controller.rb

  def index
    user_artworks = Artwork.find_by(artist_id: params[:user_id])
    shared_artworks = User.find(params[:user_id]).shared_artworks
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]