W6D3/ArtShare/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1 LIMIT $2  [["commenter_id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 1], ["LIMIT", 1]]
---
  def index
    user_comment = Comment.where(commenter_id: params[:user_id])
    artwork_comment = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("commenter_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["commenter_id", 3], ["artwork_id", 1], ["body", "Third comment"]]
---
  def create
    new_comment = Comment.new(comment_params)
    if new_comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
  def destroy
    deleted_comment = Comment.find(params[:id])
    deleted_comment.destroy