W6D3/ArtShare/app/controllers/users_controller.rb

  def index
    if request.query_string.present?
      query = User.where("username iLIKE '#{user_params[:username]}'")
      if query.empty?
        render json: 'No User found'
        return
      else
        render json: query
      end
    else
      render json: User.all
---
SELECT  "users".* FROM "users" WHERE (username LIKE '%%') LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (username iLIKE 'leo')
SELECT  1 AS one FROM "users" WHERE (username iLIKE 'leo') LIMIT $1  [["LIMIT", 1]]